AF-mainblog.org
#+STARTUP: content
#+AUTHOR: Ambrose Field
#+HUGO_BASE_DIR: .
#+HUGO_AUTO_SET_LASTMOD: 
** Architexture I, for 10 part choir
:PROPERTIES:
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :noauthor true :nocomment true :nodate true :nopaging true :noread true
:EXPORT_HUGO_MENU: :menu main
:EXPORT_HUGO_SECTION: research
:EXPORT_HUGO_WEIGHT: auto
:CUSTOM_ID: archone
:EXPORT_FILE_NAME: architexture1
:END:

18 mins |  2012 |  10-part Choir (SSAATTBarBarBB)

{{< youtube id="OksbYjYq9bg" >}}
*** About the composition

_Architexture I_ is a choral music work in which the acoustic of the performance venue is designed into the substance of the music itself. This is done through the use of three-dimensional acoustic analysis techniques to inform a traditional “pen and paper” composition process. The harmony, the speed of vocal entries, and the way they overlap each other in time, are sculpted with knowledge of the architectural acoustics of the space. Specific chords linger in the air, resulting in a beautiful unity of space and notes. Pieces in the architexture series are designed specifically for a particular choir and venue. The musical language is a richly harmonic one, exploiting the author's 'extensible polyphony' technique to achieve clarity within dense, overlapping vocal textures.

Architexture I is scored for 10 part choir (S,S,A,A,T,T,Ba,Ba,B,B one-to-a-part) lasting 18 minutes duration. 

The piece as recorded above is configured for the acoustic of the Guildhall, a heritage building in York, UK. If you would like to present a new version of this piece which fully exploit the acoustic your venue for any number of performers, I would be happy to hear from you.

See [this description]({{< ref "archproject.md" >}}) of the architexture project itself for more information.

